cfg_src/Catalogs/ноВременныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ноВременныеБазы</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ноКластеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ноСостоянияВременныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
<Attribute>
				<Properties>
					<Name>ВерсияХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииХранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИспользований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОсвобождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg_src/Catalogs/ВерсииХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииХранилища</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ХранилищаКонфигураций</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКаталогФайловКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОчередиВыполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.КопииХранилищКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМетаданных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		<Attribute>
			<Properties>
				<Name>ВременнаяБаза</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.ноВременныеБазы</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg_src/Catalogs/ноВременныеБазы/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит свободную временную базу указанного кластера.
// 
// Параметры:
// 	Кластер - СправочникСсылка.ноКластеры - кластер, в котором ищется свободная база
// Возвращаемое значение:
// 	СправочникСсылка.ноВременныеБазы, Неопределено - ссылка на свободную временную базу
Функция НайтиСвободную(Знач Кластер) Экспорт

	Если Не ЗначениеЗаполнено(Кластер) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВременныеБазы.Ссылка
	|ИЗ
	|	Справочник.ноВременныеБазы КАК ВременныеБазы
	|ГДЕ
	|	ВременныеБазы.Кластер = &Кластер
	|	И ВременныеБазы.Состояние = ЗНАЧЕНИЕ(Перечисление.ноСостоянияВременныхБаз.Свободна)
	|УПОРЯДОЧИТЬ ПО
	|	ВременныеБазы.КоличествоИспользований,
	|	ВременныеБазы.Код
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("Кластер", Кластер);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Помечает временную базу как занятую указанной версией хранилища.
// 
// Параметры:
// 	ВременнаяБаза - СправочникСсылка.ноВременныеБазы - захватываемая база
// 	ВерсияХранилища - СправочникСсылка.ВерсииХранилища - версия, для которой занята база
Процедура Занять(Знач ВременнаяБаза, Знач ВерсияХранилища = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ВременнаяБаза) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВерсияХранилища) Тогда
		ВерсияХранилища = Справочники.ВерсииХранилища.ПустаяСсылка();
	КонецЕсли;

	Объект = ВременнаяБаза.ПолучитьОбъект();
	Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.Занята;
	Объект.ВерсияХранилища = ВерсияХранилища;
	Объект.ДатаЗанятия = ТекущаяДата();
	Объект.КоличествоИспользований = Объект.КоличествоИспользований + 1;
	Объект.Записать();

КонецПроцедуры

// Освобождает временную базу.
// 
// Параметры:
// 	ВременнаяБаза - СправочникСсылка.ноВременныеБазы - освобождаемая база
Процедура Освободить(Знач ВременнаяБаза) Экспорт

	Если Не ЗначениеЗаполнено(ВременнаяБаза) Тогда
		Возврат;
	КонецЕсли;

	Объект = ВременнаяБаза.ПолучитьОбъект();
	Если Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.ТребуетПересоздания Тогда
		Возврат;
	КонецЕсли;
	Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.Свободна;
	Объект.ВерсияХранилища = Справочники.ВерсииХранилища.ПустаяСсылка();
	Объект.ДатаПоследнегоОсвобождения = ТекущаяДата();
	Объект.Записать();

КонецПроцедуры

// Помечает временную базу как требующую пересоздания.
// 
// Параметры:
// 	ВременнаяБаза - СправочникСсылка.ноВременныеБазы - база, требующая пересоздания
Процедура ПометитьПересоздание(Знач ВременнаяБаза) Экспорт

	Если Не ЗначениеЗаполнено(ВременнаяБаза) Тогда
		Возврат;
	КонецЕсли;

	Объект = ВременнаяБаза.ПолучитьОбъект();
	Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.ТребуетПересоздания;
	Объект.ВерсияХранилища = Справочники.ВерсииХранилища.ПустаяСсылка();
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
